# 包：本质就是要一个文件夹，该文件夹中可以包含若干python模块(.py)，文件夹下还包含了一个__init__.py,与普通文件夹的不同
# 作用：模块文件较多时，用来管理多个模块(包的本质也是一个模块)
# ===================== Python 模块导入方式 =====================

# 方式1：
# 导入形式：
# import 包名.模块名
#
# 代码示例：
# import utils.my_fun
#
# 调用方式：
# 包名.模块名.功能名()
#
# 示例：
# utils.my_fun.log_separator1()


# ------------------------------------------------------------


# 方式2：
# 导入形式：
# from 包名 import 模块名
#
# 代码示例：
# from utils import my_fun
#
# 调用方式：
# 模块名.功能名()
#
# 示例：
# my_fun.log_separator1()


# ------------------------------------------------------------


# 方式3：
# 导入形式：
# from 包名 import *
#
# 代码示例：
# from utils import *
#
# 调用方式：
# 模块名.功能名()
#
# 示例：
# my_fun.log_separator1()


# ------------------------------------------------------------


# 方式4：
# 导入形式：
# from 包名.模块名 import 功能名
#
# 代码示例：
# from utils.my_fun import log_separator1
#
# 调用方式：
# 功能名()
#
# 示例：
# log_separator1()


# ------------------------------------------------------------


# 方式5：
# 导入形式：
# from 包名.模块名 import *
#
# 代码示例：
# from utils.my_fun import *
#
# 调用方式：
# 功能名()
#
# 示例：
# log_separator1()