#字面量：程序中直接书写的固定值（数据）
#字面量类型:数字类型：整数int，浮点数、小数（float）
#布尔（bool）：Ture，False，涉及到数学运算时，自动转为1,0
#字符串（str）：描述文本的数据类型（必须用“ ”括起）
#空值（NoneType）：表示空或无值，仅包含一个值None，None
#数据容器：存储多项数据的容器。列表/元组/集合/字典
100
3.14
print(100)
print(True)
print(False)
print("hhh")
print('hhh')
print(None)

print(True+1)#布尔类型本质也是整数类型

#变量：程序中用来存储单个数据的容器，通常把会经常发生变化的数据存储在变量中。变量指那个容器，而不是值。
num = 20260819#Python是动态类型语言，不需要指定变量类型，在程序运行时才进行类型检查，变量的类型可以再程序运行过程中改变，一个变量可以接收不同类型的值。
#但在项目开发中，一般一个变量只会接收一个类型的值
print(num)
num = num + 1
print(num)

num = "hh"
print(num)

a = 20.7
a = a + 50
print(a)
a = a + 50
print(a)
b,c = 2026,"0819"#一次定义多个变量
print("date:",20260819)#一次输出多变量，逗号隔开






